import sqlite3


con = sqlite3.connect("instance/database.db")
cur = con.cursor()

activities = [
    ("瑜伽課程","放鬆身心的瑜伽課程，適合初學者","運動,放鬆,紓壓","yoga.jpg"),    
    ("手作課程", "學習製作手工藝品，享受創作樂趣", "藝術,創作,手作,放鬆","handmade.jpg"),
    ("大自然露營", "遠離城市喧囂，享受自然風光", "戶外,放鬆,露營,休閒","camp.jpg"),
    ("音樂冥想", "伴隨輕音樂進行深度冥想，釋放壓力", "冥想,音樂,放鬆","thinking.jpg"),
    ("烘焙課程", "製作甜點或麵包，享受烹飪樂趣", "烘焙,手作,創作,紓壓","bake.jpg"),
    ("攝影挑戰", "挑戰拍攝不同主題的照片，提升觀察力", "攝影,創作,藝術,放鬆","photo.jpg"),
    ("書法練習", "練習書法字帖，專注於字的美感", "書法,藝術,放鬆","write.jpg"),
    ("桌遊聚會", "邀請朋友一起玩桌上遊戲，增進感情", "遊戲,社交,放鬆","puzzle.jpg"),
    ("園藝活動", "種植植物或花卉，接近自然", "園藝,戶外,放鬆,休閒","plant.jpg"),
    ("騎行活動", "沿著風景優美的路線騎自行車，釋放壓力", "運動,騎行,戶外,紓壓,休閒","ride.jpg"),
    ("慢跑社群", "參與社群慢跑活動，結識新朋友", "運動,跑步,社交,放鬆","jogging.jpg"),
    ("即興畫畫", "自由揮灑創意，畫下內心的感受", "藝術,創作,放鬆","draw.jpg"),
    ("陶藝製作", "用陶土製作器皿或裝飾品，放鬆心情", "手作,創作,陶藝,紓壓","pottery.jpg"),
    ("電影之夜", "挑選一部好電影，在家享受舒適時光", "娛樂,電影,放鬆","movie.jpg"),
    ("讀書會", "與志同道合的人分享閱讀心得", "閱讀,社交,學習,放鬆","read.jpg"),
    ("音樂課程", "學習一種新樂器，享受音樂的樂趣", "音樂,學習,創作,紓壓","music.jpg"),
    ("釣魚活動", "在安靜的湖邊享受釣魚的樂趣", "戶外,放鬆,釣魚,休閒","fishing.jpg"),
    ("遠足挑戰", "探索新的登山路線，挑戰自己", "戶外,運動,遠足,紓壓,休閒","hike.jpg"),
    ("咖啡品鑑", "學習如何品嚐不同種類的咖啡", "咖啡,學習,放鬆","coffee.jpg"),
    ("DIY 家具", "利用木材製作小型家具，創造實用性作品", "手作,創作,DIY,紓壓","DIY.jpg"),

]
cur.executemany(
    "INSERT INTO activities (name, description, tags, image_filename) VALUES (?, ?, ?, ?)", activities
)
con.commit()
